11/data/attachments/d8f7e93c36e5843b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Kyle_member_Friend_48528_9</nif:username>
            <nif:friendToBeRequested>soap_friends_3d174bf0-a09e-44ea-8541-0067932a553e</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>